{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "getelementptr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 6,
      "content": "switch",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "and",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "mul",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "va_arg",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "cleanuppad",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "fence",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "fpext",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "br",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "ptrtoint",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "catchret",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "ret",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "sdiv",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "shufflevector",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "or",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "fptrunc",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "select",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "add",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "urem",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "atomicrmw",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "indirectbr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 26,
      "content": "invoke",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 27,
      "content": "addrspacecast",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 28,
      "content": "fcmp",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 29,
      "content": "fptosi",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 30,
      "content": "freeze",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 31,
      "content": "sext",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 32,
      "content": "store",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 33,
      "content": "fadd",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 34,
      "content": "landingpad",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 35,
      "content": "catchswitch",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 36,
      "content": "extractelement",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 37,
      "content": "phi",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 38,
      "content": "unreachable",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 39,
      "content": "bitcast",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 40,
      "content": "load",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 41,
      "content": "alloca",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 42,
      "content": "xor",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 43,
      "content": "udiv",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 44,
      "content": "insertvalue",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 45,
      "content": "fmul",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 46,
      "content": "shl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 47,
      "content": "cmpxchg",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 48,
      "content": "icmp",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 49,
      "content": "ashr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 50,
      "content": "sitofp",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 51,
      "content": "fsub",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 52,
      "content": "lshr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 53,
      "content": "zext",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 54,
      "content": "extractvalue",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 55,
      "content": "trunc",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 56,
      "content": "inttoptr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 57,
      "content": "resume",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 58,
      "content": "cleanupret",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 59,
      "content": "call",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 60,
      "content": "catchpad",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 61,
      "content": "fdiv",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 62,
      "content": "fptoui",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 63,
      "content": "noundef",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 64,
      "content": "nonnull",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 65,
      "content": "dereferenceable",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 66,
      "content": "align",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 67,
      "content": "addrspace",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 68,
      "content": "inbounds",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 69,
      "content": "zeroext",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 70,
      "content": "noalias",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 71,
      "content": "nounwind",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 72,
      "content": "nnan",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 73,
      "content": "ninf",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 74,
      "content": "nsz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 75,
      "content": "var",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 76,
      "content": "fast",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 77,
      "content": "immarg",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 78,
      "content": "returned",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 79,
      "content": "poison",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "$": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "@": 27,
      "[": 28,
      "]": 29,
      "_": 30,
      "a": 31,
      "b": 32,
      "c": 33,
      "d": 34,
      "e": 35,
      "f": 36,
      "g": 37,
      "h": 38,
      "i": 39,
      "j": 40,
      "k": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "q": 47,
      "r": 48,
      "s": 49,
      "t": 50,
      "u": 51,
      "v": 52,
      "w": 53,
      "x": 54,
      "y": 55,
      "z": 56,
      "##4": 57,
      "##c": 58,
      "##l": 59,
      "##i": 60,
      "##e": 61,
      "##d": 62,
      "##t": 63,
      "##o": 64,
      "##r": 65,
      "##f": 66,
      "##p": 67,
      "##a": 68,
      "##3": 69,
      "##9": 70,
      "##1": 71,
      "##2": 72,
      "##0": 73,
      "##b": 74,
      "##s": 75,
      "##8": 76,
      "##7": 77,
      "##w": 78,
      "##v": 79,
      "##k": 80,
      "##y": 81,
      "##m": 82,
      "##5": 83,
      "##n": 84,
      "##6": 85,
      "##u": 86,
      "##h": 87,
      "##z": 88,
      "##g": 89,
      "##j": 90,
      "##x": 91,
      "##q": 92,
      "##ar": 93,
      "var": 94,
      "##64": 95,
      "i64": 96,
      "var1": 97,
      "al": 98,
      "##ig": 99,
      "##ign": 100,
      "align": 101,
      "##el": 102,
      "##ab": 103,
      "lab": 104,
      "label": 105,
      "var2": 106,
      "##32": 107,
      "i1": 108,
      "##to": 109,
      "i32": 110,
      "var3": 111,
      "to": 112,
      "var4": 113,
      "##re": 114,
      "##tore": 115,
      "store": 116,
      "##on": 117,
      "##28": 118,
      "##al": 119,
      "##oa": 120,
      "##oad": 121,
      "load": 122,
      "var5": 123,
      "i128": 124,
      "##tr": 125,
      "##nt": 126,
      "##un": 127,
      "var6": 128,
      "i8": 129,
      "##unc": 130,
      "##ptr": 131,
      "var7": 132,
      "##dd": 133,
      "add": 134,
      "br": 135,
      "##all": 136,
      "##mp": 137,
      "##cmp": 138,
      "call": 139,
      "icmp": 140,
      "##lo": 141,
      "int": 142,
      "##toptr": 143,
      "inttoptr": 144,
      "var8": 145,
      "##ti": 146,
      "##tion": 147,
      "func": 148,
      "function": 149,
      "var9": 150,
      "##ca": 151,
      "eq": 152,
      "var10": 153,
      "allo": 154,
      "alloca": 155,
      "var11": 156,
      "##st": 157,
      "var12": 158,
      "ar": 159,
      "arg": 160,
      "con": 161,
      "var13": 162,
      "const": 163,
      "var14": 164,
      "var0": 165,
      "var15": 166,
      "i16": 167,
      "var16": 168,
      "var17": 169,
      "var18": 170,
      "var19": 171,
      "##ul": 172,
      "var20": 173,
      "var21": 174,
      "##et": 175,
      "##ex": 176,
      "##ext": 177,
      "##int": 178,
      "ptr": 179,
      "##toint": 180,
      "ptrtoint": 181,
      "##lob": 182,
      "glob": 183,
      "global": 184,
      "arg1": 185,
      "var22": 186,
      "##se": 187,
      "var24": 188,
      "var23": 189,
      "var25": 190,
      "fal": 191,
      "false": 192,
      "var27": 193,
      "tr": 194,
      "var26": 195,
      "var28": 196,
      "var29": 197,
      "trunc": 198,
      "var30": 199,
      "zext": 200,
      "var31": 201,
      "ret": 202,
      "var32": 203,
      "##29": 204,
      "var34": 205,
      "var35": 206,
      "var33": 207,
      "var37": 208,
      "##sw": 209,
      "var38": 210,
      "var36": 211,
      "var39": 212,
      "##ull": 213,
      "var40": 214,
      "var41": 215,
      "16": 216,
      "##nd": 217,
      "mul": 218,
      "and": 219,
      "##lt": 220,
      "var44": 221,
      "var42": 222,
      "var43": 223,
      "non": 224,
      "##null": 225,
      "nonnull": 226,
      "var45": 227,
      "arg2": 228,
      "##ele": 229,
      "var47": 230,
      "var46": 231,
      "var48": 232,
      "11": 233,
      "nsw": 234,
      "var49": 235,
      "var50": 236,
      "var51": 237,
      "10": 238,
      "12": 239,
      "var54": 240,
      "var53": 241,
      "var55": 242,
      "var52": 243,
      "var57": 244,
      "var56": 245,
      "var58": 246,
      "var59": 247,
      "ult": 248,
      "var60": 249,
      "var61": 250,
      "##67": 251,
      "##it": 252,
      "##49": 253,
      "var64": 254,
      "var65": 255,
      "var63": 256,
      "var62": 257,
      "##rem": 258,
      "urem": 259,
      "var67": 260,
      "in": 261,
      "24": 262,
      "var68": 263,
      "bit": 264,
      "var66": 265,
      "##cast": 266,
      "bitcast": 267,
      "##me": 268,
      "nu": 269,
      "nuw": 270,
      "var69": 271,
      "var70": 272,
      "##4967": 273,
      "##496729": 274,
      "##4967295": 275,
      "var71": 276,
      "13": 277,
      "get": 278,
      "##ment": 279,
      "##bo": 280,
      "##ds": 281,
      "##unds": 282,
      "##element": 283,
      "inbo": 284,
      "getelement": 285,
      "inbounds": 286,
      "getelementptr": 287,
      "429": 288,
      "4294967295": 289,
      "15": 290,
      "var75": 291,
      "var74": 292,
      "var73": 293,
      "var72": 294,
      "32": 295,
      "14": 296,
      "##ub": 297,
      "var77": 298,
      "var78": 299
    }
  }
}